In [957]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [1]:
import psycopg2

from sqlalchemy import create_engine

ImportError: DLL load failed while importing _psycopg: Le module spécifié est introuvable.

In [959]:
folder = 'D:/Data_Analyst_Projet/Projet 8/Tableau/Fichiers csv nettoyes/'
folder_import = 'D:/Data_Analyst_Projet/Projet 8/Donnée debut projet/DAN-P8-donnees/donnees_python/'

In [960]:
population=pd.read_csv(folder+'population.csv')
region=pd.read_csv(folder+'continent.csv')
political_stability=pd.read_csv(folder+'political_stability.csv')
mortality_water=pd.read_csv(folder+'mortality_water.csv')
water_service=pd.read_csv(folder+'water_service.csv')

## Création base de données

In [961]:
from sklearn.preprocessing import LabelEncoder

### Table continent

In [962]:
continent = region.copy()

#### Encodage

In [964]:
# on enregistre une ligne 'unknown' pour l'encodage de id_continent
# permettra de faire l'association entre les pays sans continents et la table continent
continent = continent.append({'Continent':'unknown', 'Country':'unknown'}, ignore_index=True)


# création des transformeur
encodeur = LabelEncoder()

encodeur.fit_transform(continent['Continent'])

array([3, 3, 3, 5, 3, 3, 2, 4, 3, 3, 4, 3, 0, 1, 3, 5, 1, 1, 5, 1, 0, 1,
       3, 3, 3, 0, 4, 3, 1, 1, 3, 0, 0, 3, 3, 0, 3, 3, 0, 3, 1, 1, 1, 3,
       3, 4, 2, 2, 3, 3, 3, 5, 2, 3, 0, 2, 3, 5, 3, 2, 3, 3, 5, 3, 1, 3,
       5, 3, 2, 4, 3, 5, 1, 0, 5, 3, 3, 2, 2, 1, 1, 5, 3, 3, 2, 5, 3, 3,
       3, 0, 5, 3, 3, 0, 5, 3, 3, 0, 3, 4, 3, 3, 3, 2, 3, 5, 0, 3, 3, 0,
       1, 1, 3, 5, 0, 2, 0, 0, 1, 1, 1, 1, 1, 0, 1, 5, 0, 0, 0, 0, 0, 0,
       0, 5, 1, 0, 2, 1, 1, 2, 0, 0, 5, 0, 0, 0, 1, 1, 4, 1, 5, 0, 0, 2,
       0, 0, 4, 0, 5, 0, 0, 5, 0, 4, 0, 5, 0, 5, 1, 5, 1, 1, 1, 0, 2, 0,
       0, 5, 2, 0, 2, 1, 2, 4, 4, 0, 5, 1, 3, 2, 1, 5, 2, 0, 6])

In [965]:
# création de la table continent et de l'id_continent grace au transformeur
continent = continent.drop(columns='Country').drop_duplicates().reset_index(drop=True)
continent['id_continent'] = encodeur.fit_transform(continent['Continent'])

In [966]:
# renommage colonne
continent = continent.rename(columns={'Continent':'continent'})

### Table pays_annee

In [ ]:
# import fichier global

df = pd.read_csv(folder_import+'jointure.csv')

In [967]:
# Manipulation à partir du fichier global df pour sortir la table des pays en entier

C = df.copy()

C = C[(C['Granularity']=='Total')]

C = C[C['Population'].notna()]

C = C[['Country', 'Year', 'Political_Stability', 'Region']].reset_index(drop=True)

In [968]:
# Encodage et creation des clés

C.loc[C['Region'].isna(), 'Region'] = 'unknown'

C['id_pays_year'] = encodeur.fit_transform(C['Country']+C['Year'].astype('str'))

C['id_continent'] = encodeur.fit_transform(C['Region'])

C = C.drop(columns='Region')

C.head()

In [977]:
# Nom final + renommage colonnes

pays_annee = C

pays_annee.columns = ['country', 'year', 'political_stability', 'id_pays_year', 'id_continent']

### Table pays_genre

In [981]:
A = df.copy()

A = A[(A['Granularity']=='Male')|((A['Granularity']=='Female'))]

pays_genre = A[['Country', 'Granularity', 'Year', 'Population', 'WASH deaths']].reset_index(drop=True)

pays_genre.columns = ['country', 'genre', 'year', 'population', 'water_death_number']

pays_genre['id_pays_genre']=encodeur.fit_transform(pays_genre['country']+pays_genre['genre']+pays_genre['year'].astype('str'))

pays_genre['id_pays_year']=encodeur.fit_transform(pays_genre['country']+pays_genre['year'].astype('str'))

pays_genre = pays_genre.drop(columns=['country', 'year'])

pays_genre.head()

In [1008]:
pays_genre.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 7618 entries, (19, 0) to (7598, 3808)
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   genre               7618 non-null   object
 1   population          7618 non-null   float64
 2   water_death_number  366 non-null    float64
dtypes: float64(2), object(1)
memory usage: 684.8+ KB

### Table pays_zone

In [988]:
B = df.copy()

B = B[(B['Granularity']=='Rural')|((B['Granularity']=='Urban'))]

B = B[B['Population'].notna()]

B = B[['Country', 'Granularity', 'Year', 'Population',
       'basic_service_water_population', 'safely_service_water_population']].reset_index(drop=True)

B.columns = ['country', 'zone', 'year', 'population',
       'basic_service_water_population', 'safely_service_water_population']

pays_zone = B

pays_zone['id_pays_zone']=encodeur.fit_transform(pays_zone['country']+pays_zone['zone']+pays_zone['year'].astype('str'))

pays_zone['id_pays_year']=encodeur.fit_transform(pays_zone['country']+pays_zone['year'].astype('str'))

pays_zone = pays_zone.drop(columns=['country', 'year'])

## Recap fichiers

In [997]:
continent

               continent  id_continent
0                 Europe             3
1        Western Pacific             5
2  Eastern Mediterranean             2
3        South-East Asia             4
4                 Africa             0
5               Americas             1
6                unknown             6

In [998]:
pays_annee

          country  year  political_stability  id_pays_year  id_continent
0     Afghanistan  2000                -2.44             0             2
1     Afghanistan  2001                  NaN             1             2
2     Afghanistan  2002                -2.04             2             2
3     Afghanistan  2003                -2.20             3             2
4     Afghanistan  2004                -2.30             4             2
...           ...   ...                  ...           ...           ...
4406     Zimbabwe  2014                -0.71          4406             0
4407     Zimbabwe  2015                -0.62          4407             0
4408     Zimbabwe  2016                -0.62          4408             0
4409     Zimbabwe  2017                -0.71          4409             0
4410     Zimbabwe  2018                -0.71          4410             0

[4411 rows x 5 columns]

In [999]:
pays_genre

       genre  population  water_death_number  id_pays_genre  id_pays_year
0       Male  10689508.0                 NaN             19             0
1     Female  10090449.0                 NaN              0             0
2       Male  11117754.0                 NaN             20             1
3     Female  10489238.0                 NaN              1             1
4       Male  11642106.0                 NaN             21             2
...      ...         ...                 ...            ...           ...
7613  Female   7356132.0         1630.404269           7596          3806
7614    Male   6777054.0                 NaN           7616          3807
7615  Female   7459545.0                 NaN           7597          3807
7616    Male   6879119.0                 NaN           7617          3808
7617  Female   7559693.0                 NaN           7598          3808

[7618 rows x 5 columns]

In [1000]:
pays_zone

,zone,population,basic_service_water_population,safely_service_water_population,id_pays_zone,id_pays_year
0,Rural,15657474.0,3.385010e+06,NaN,0,0
1,Urban,4436282.0,2.195403e+06,NaN,19,0
2,Rural,16318324.0,3.527880e+06,NaN,1,1
3,Urban,4648139.0,2.300245e+06,NaN,20,1
4,Rural,17086910.0,4.032490e+06,NaN,2,2
...,...,...,...,...,...,...
8785,Urban,5215894.0,4.906026e+06,NaN,8787,4392
8786,Rural,11201138.0,5.578700e+06,NaN,8769,4393
8787,Urban,5328766.0,5.008916e+06,NaN,8788,4393
8788,Rural,11465748.0,NaN,NaN,8770,4394
8789,Urban,5447513.0,NaN,NaN,8789,4394

## Export dans Postgresql

In [1001]:
# création de la connexion 
conn = psycopg2.connect(
    host="localhost",
    database="ProjetWater",
    user="postgres",
    password="radrio06"
)

# création de l'engine qui sert à la connection
engine = create_engine('postgresql://postgres:radrio06@localhost:5432/ProjetWater')

In [1002]:
# mise en place de l'index
continent.set_index('id_continent', inplace=True)
pays_annee.set_index(['id_pays_year', 'id_continent'], inplace=True)
pays_genre.set_index(['id_pays_genre', 'id_pays_year'], inplace=True)
pays_zone.set_index(['id_pays_zone', 'id_pays_year'], inplace=True)

In [1003]:
# export
continent.to_sql('continent', engine, if_exists='replace', index=True)

7

In [1004]:
pays_annee.to_sql('pays_annee', engine, if_exists='replace', index=True)
pays_genre.to_sql('pays_genre', engine, if_exists='replace', index=True)
pays_zone.to_sql('pays_zone', engine, if_exists='replace', index=True)

790

In [1005]:
# valide le commit, les modifications effectuées dans la base
conn.commit()

# ferme la connexion en fin de programme
conn.close()

In [1010]:
df['Granularity'].value_counts()

Total     4447
Rural     4431
Urban     4431
Male      3809
Female    3809
Name: Granularity, dtype: int64

In [1011]:
df

,Country,Granularity,Year,Population,Political_Stability,Region,mortality_rate_water,WASH deaths,basic_service_water,safely_service_water,basic_service_water_population,safely_service_water_population
0,Afghanistan,Total,2000,20779953.0,-2.44,Eastern Mediterranean,NaN,NaN,27.77190,NaN,5.770988e+06,NaN
1,Afghanistan,Male,2000,10689508.0,NaN,Eastern Mediterranean,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,Female,2000,10090449.0,NaN,Eastern Mediterranean,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,Rural,2000,15657474.0,NaN,Eastern Mediterranean,NaN,NaN,21.61913,NaN,3.385010e+06,NaN
4,Afghanistan,Urban,2000,4436282.0,NaN,Eastern Mediterranean,NaN,NaN,49.48745,NaN,2.195403e+06,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
20922,Sudan,Urban,2010,NaN,NaN,NaN,NaN,NaN,67.27745,NaN,NaN,NaN
20923,South Sudan,Rural,2011,NaN,NaN,NaN,NaN,NaN,38.68334,NaN,NaN,NaN
20924,South Sudan,Urban,2011,NaN,NaN,NaN,NaN,NaN,52.01019,NaN,NaN,NaN
20925,Sudan,Rural,2011,NaN,NaN,NaN,NaN,NaN,45.74108,NaN,NaN,NaN
20926,Sudan,Urban,2011,NaN,NaN,NaN,NaN,NaN,68.43725,NaN,NaN,NaN